# IdeaStatiCa.RcsApi.Model.TendonDuct

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Id** | **int** |  | [optional]
**Point** | **Point2D** |  | [optional]
**MaterialDuct** | **MaterialDuct** |  | [optional]
**IsDebondingTube** | **bool** |  | [optional]
**Diameter** | **double** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)